#encoding: utf-8


require_relative 'cdate'
require_relative 'goleph.rb'
require 'time'


  

def main()


	if ARGV.length < 1
		puts "Usage: ruby ziwei.rb <born datetime> [<today datetime>] [<m|f>]"
		return
	end



	v = {}
	v["天干"] 	= 	[ "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸" ]
	v["地支"] 	= 	[ "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]
	v["月"] 		= 	['十一','十二','正','二','三','四','五','六','七','八','九','十']

	v["十二宫"]  = 	[ "命宫", "兄弟", "夫妻", "子女", "财帛", "疾厄", "迁移", "仆役", "官禄", "田宅", "福德", "父母"]
	v["五行"] 	= 	[ "金","木","水","火","土"]
	v["五行局"] 	=	[ "水二","木三","金四","土五","火六" ]
	v["长生"] 	= 	[ "长生" ,"沐浴" ,"冠带", "临官", "帝旺", "衰", "病", "死", "墓", "绝" ,"胎" ,"养"]


	o = {}
	o["五虎遁"] = [ 2,4,6,8,0,2,4,6,8,0]
	o["五鼠遁"] = [ 0,2,4,6,8,0,2,4,6,8]


	o["五行局"]	= { 
					[ 0,0 ] =>2, [ 0, 1] =>2, [ 0,6 ] =>2, [ 0, 7] =>2, 
					[ 1,0 ] =>2, [ 1, 1] =>2, [ 1,6 ] =>2, [ 1, 7] =>2, 
					[ 0,2 ] =>0, [ 0, 3] =>0, [ 0,8 ] =>0, [ 0, 9] =>0, 
					[ 1,2 ] =>0, [ 1, 3] =>0, [ 1,8 ] =>0, [ 1, 9] =>0, 
					[ 0,4  ]=>4, [ 0, 5 ]=>4, [ 0,10 ]=>4, [ 0, 11]=>4, 
					[ 1,4  ]=>4, [ 1, 5 ]=>4, [ 1,10 ]=>4, [ 1, 11]=>4, 
										
					[ 2,0 ] =>0, [ 2, 1] =>0, [ 2,6 ] =>0, [ 2, 7] =>0, 
					[ 3,0 ] =>0, [ 3, 1] =>0, [ 3,6 ] =>0, [ 3, 7] =>0, 
					[ 2,2 ] =>4, [ 2, 3] =>4, [ 2,8 ] =>4, [ 2, 9] =>4, 
					[ 3,2 ] =>4, [ 3, 3] =>4, [ 3,8 ] =>4, [ 3, 9] =>4, 
					[ 2,4  ]=>3, [ 2, 5 ]=>3, [ 2,10 ]=>3, [ 2, 11]=>3, 
					[ 3,4  ]=>3, [ 3, 5 ]=>3, [ 3,10 ]=>3, [ 3, 11]=>3, 
					
					[ 4,0 ] =>4, [ 4, 1] =>4, [ 4,6 ] =>4, [ 4, 7] =>4, 
					[ 5,0 ] =>4, [ 5, 1] =>4, [ 5,6 ] =>4, [ 5, 7] =>4, 
					[ 4,2 ] =>3, [ 4, 3] =>3, [ 4,8 ] =>3, [ 4, 9] =>3, 
					[ 5,2 ] =>3, [ 5, 3] =>3, [ 5,8 ] =>3, [ 5, 9] =>3, 
					[ 4,4  ]=>1, [ 4, 5 ]=>1, [ 4,10 ]=>1, [ 4, 11]=>1, 
					[ 5,4  ]=>1, [ 5, 5 ]=>1, [ 5,10 ]=>1, [ 5, 11]=>1, 

					[ 6,0 ] =>3, [ 6, 1] =>3, [ 6,6 ] =>3, [ 6, 7] =>3, 
					[ 7,0 ] =>3, [ 7, 1] =>3, [ 7,6 ] =>3, [ 7, 7] =>3, 
					[ 6,2 ] =>1, [ 6, 3] =>1, [ 6,8 ] =>1, [ 6, 9] =>1, 
					[ 7,2 ] =>1, [ 7, 3] =>1, [ 7,8 ] =>1, [ 7, 9] =>1, 
					[ 6,4  ]=>2, [ 6, 5 ]=>2, [ 6,10 ]=>2, [ 6, 11]=>2, 
					[ 7,4  ]=>2, [ 7, 5 ]=>2, [ 7,10 ]=>2, [ 7, 11]=>2, 
					
					[ 8,0 ] =>1, [ 8, 1] =>1, [ 8,6 ] =>1, [ 8, 7] =>1, 
					[ 9,0 ] =>1, [ 9, 1] =>1, [ 9,6 ] =>1, [ 9, 7] =>1, 
					[ 8,2 ] =>2, [ 8, 3] =>2, [ 8,8 ] =>2, [ 8, 9] =>2, 
					[ 9,2 ] =>2, [ 9, 3] =>2, [ 9,8 ] =>2, [ 9, 9] =>2, 
					[ 8,4  ]=>0, [ 8, 5 ]=>0, [ 8,10 ]=>0, [ 8, 11]=>0, 
					[ 9,4  ]=>0, [ 9, 5 ]=>0, [ 9,10 ]=>0, [ 9, 11]=>0, 
					
				}


	o["长生"] 	= [ 8, 11, 6, 2, 2 ]
	


	v["星"] = [ 
				"紫微","天机","太阳","武曲","天同","廉贞",   				
				"天府","太阴","贪狼","巨门","天相","天梁","七杀","破军",		
				"左辅","右弼","文曲","文昌","天魁","天钺","禄存",			
				"擎羊","陀螺","火星","铃星","地空","地劫",					
				"天马","红鸳","天喜","孤辰","寡宿","天刑","天姚","年解", 	
				"天官","天福","天厨","截路","空亡","解神","天巫","天月","阴煞","台辅","封诰", 
				"天才","天寿","华盖","天空","天哭","天虚","咸池","龙池","凤阁","蜚廉","破碎",  
				"三台","八座","恩光","天贵", 
				"天殇","天使",  
				"岁建","晦气","丧门","贯索","官符","小耗","大耗","龙德","白虎","天德","吊客","病符", 
				"旬空",
				"流昌","流曲","流魁","流钺","流禄","流羊","流陀","流鸳","流喜",
				"运昌","运曲","运魁","运钺","运禄","运羊","运陀" 
			]


	xi = {}
	v["星"].each_index { |i| 
		xi[v["星"][i]] = i
	}

	o["天府"] 	= [ 4, 3, 2, 1, 0, 11, 10, 9 , 8 ,7 , 6, 5 ]
	o["天魁"] 	= [  1,  0, 11,11, 1,0,   1,6,5,5   ]
	o["天钺"] 	= [  7,  8,  9, 9, 7,8,   7,2,3,3   ]
	o["禄存"] 	= [  2, 3,  5, 6 ,5,   6, 8,9, 11, 0]   
	


	v["十干四化"] = [ "禄","权","科","忌"]
	o["十干四化"] = [
						[ "廉贞", "破军" ,"武曲","太阳" ],
						[ "天机", "天梁" ,"紫微","太阴" ],
						[ "天同", "天机" ,"文昌","廉贞" ],
						[ "太阴", "天同" ,"天机","巨门" ],
						[ "贪狼", "太阴" ,"右弼","天机" ],
						[ "武曲", "贪狼" ,"天梁","文曲" ],
						[ "太阳", "武曲" ,"天府","天同" ],
						[ "巨门", "太阳" ,"文曲","文昌" ],
						[ "天梁", "紫薇" ,"左辅","武曲" ],
						[ "破军", "巨门" ,"太阴","贪狼" ]
					]	


	o["地支庙陷"] = [
		# 紫微 ,天机, 太阳, 武曲, 天同. 廉贞
		[ 2, 1, 1, 1, 2, 1,  1, 1, 1, 1, 2, 1 ],
		[ 1,-1, 2, 1, 2, 2,  1,-1, 2, 1, 2, 2 ],
		[-1,-1, 1, 1, 1, 1,  1, 2, 2, 2,-1,-1 ],
		[ 1, 1, 2, 2, 1, 2,  1, 1, 2, 2, 1, 2 ],
		[ 1,-1,2,2,2,1,-1,-1,1,2,2,1],
		[2,2,1,2,2,-1,2,2,1,2,2,-1],
		
		# 天府，太阴，贪狼， 巨门，天相，天梁， 七杀， 破军
		[1,1,1,2,1,2,1,1,2,1,1,2],
		[1,1,1,-1,-1,-1,-1,-1,2,1,1,1],
		[1,1,2,2,1,-1,1,1,2,2,1,-1],
		[1,-1,1,1,-1,1,1,-1,1,1,-1,1],
		[1,1,1,-1,2,2,1,2,1,-1,2,2],
		[1,1,1,1,1,-1,1,1,-1,2,1,-1],
		[1,1,1,1,1,2,1,1,1,1,1,2],
		[1,1,2,-1,1,2,1,1,2,-1,1,2],
		
		# 左辅， 右弼， 文曲， 文昌， 天魁， 天钺， 禄存
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[2,1,2,1,2,1,-1,1,2,1,-1,1],
		[2,1,-1,2,2,1,-1,2,2,1,-1,2],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[1,0,1,1,0,1,1,0,1,1,0,1],
		
		# 擎羊，陀螺， 火星，铃星 ,地空，地劫
		[-1,1,0,-1,1,0,-1,1,0,-1,1,0],
		[0,1,-1,0,1,-1,0,1,-1,0,1,-1],
		[-1,2,1,2,-1,2,1,2,-1,2,1,2],
		[-1,2,1,2,-1,2,1,2,-1,2,1,2],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		
		# 天马， 红鸳， 天喜 ， 孤辰 ，寡宿, 天刑， 天姚， 天德， 年解
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[2,-1,1,1,2,2,2,-1,2,1,1,2],
		[2,-1,2,1,2,2,2,-1,2,1,1,1],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		[0,0,0,0,0,0,0,0,0,0,0,0],
		
	]




	nongli = CDate.new()
	

	# Born date
	dt = DateTime.parse( ARGV[0] )
	nongdate = nongli.to_ccal( dt )
	sizhu 		= nongli.bazi( dt )
	
	# Today / User selected today date
	dt_today = ARGV[1] != nil ? DateTime.parse( ARGV[1] ) : DateTime.now() 
	nongdate_today = nongli.to_ccal( dt_today) 
	sizhu_today	= nongli.bazi( dt_today )

	# Gender
	gender = ARGV[2] != nil ? ["f","m"].index(ARGV[2]) : 1

	
	# 命宫，身宫	
	minggong = (nongdate[:imonth] + 2 - sizhu[3][1])	% 12
	shengong = (nongdate[:imonth] + 2 + sizhu[3][1])  	% 12
	

	#五局
	monthoff = []
	monthoff[0] = o["五虎遁"][  sizhu[0][0] ]
	monthoff[1] = o["五虎遁"][  (sizhu[0][0] + 1) % 10 ]

	effective_monthoff = monthoff[ minggong < 2 ? 1 : 0 ]
	wuxingju = o["五行局"][[ (effective_monthoff + minggong - 2) % 10 ,minggong] ]

	


	# 14 主星
	# 紫薇 ,天机, 太阳, 武曲, 天同. 廉贞
	xp = []
	lrxp = []


	x = 0
	(0...6).each { |i|
		if ( nongdate[:iday] + 1 + i ) % ( wuxingju + 2 ) == 0
			x = i
			break
		end
	}
	y = (nongdate[:iday] + 1 + x) / ( wuxingju + 2 )
	
	if x % 2 == 0
		xp[xi["紫微"]] = (y + 1 + x) % 12
	else
		xp[xi["紫微"]] = (y + 1 - x) % 12
	end

	
	xp[xi["天机"]] = (xp[xi["紫微"]] - 1) % 12
	xp[xi["太阳"]] = (xp[xi["紫微"]] - 3) % 12
	xp[xi["武曲"]] = (xp[xi["紫微"]] - 4) % 12
	xp[xi["天同"]] = (xp[xi["紫微"]] - 5) % 12
	xp[xi["廉贞"]] = (xp[xi["紫微"]] - 8) % 12

	# 天府，太阴，贪狼， 巨门，天相，天梁， 七杀， 破军
	xp[xi["天府"]] 	= o["天府"][xp[xi["紫微"]]]
	xp[xi["太阴"]]	= (xp[xi["天府"]] + 1 ) % 12
	xp[xi["贪狼"]]	= (xp[xi["天府"]] + 2 ) % 12
	xp[xi["巨门"]]	= (xp[xi["天府"]] + 3 ) % 12
	xp[xi["天相"]]	= (xp[xi["天府"]] + 4 ) % 12
	xp[xi["天梁"]]	= (xp[xi["天府"]] + 5 ) % 12
	xp[xi["七杀"]]	= (xp[xi["天府"]] + 6 ) % 12
	xp[xi["破军"]]	= (xp[xi["天府"]] + 10 ) % 12


	# 13 吉凶星
	# 7 吉星
	# 左辅， 右弼， 文曲， 文昌， 天魁， 天钺， 禄存
	xp[xi["左辅"]] = (4 + nongdate[:imonth]) % 12
	xp[xi["右弼"]] = (10 - nongdate[:imonth]) % 12
	xp[xi["文曲"]] = (4 + sizhu[3][1] ) % 12
	xp[xi["文昌"]] = (10 - sizhu[3][1]) % 12
	xp[xi["天魁"]] = o["天魁"][sizhu[0][0]] 
	xp[xi["天钺"]] = o["天钺"][sizhu[0][0]]
	xp[xi["禄存"]] = o["禄存"][sizhu[0][0]]

	# 6 凶星
	# 擎羊，陀螺， 火星，铃星 ,地空，地劫
	xp[xi["擎羊"]] = (xp[xi["禄存"]] + 1) % 12
	xp[xi["陀螺"]] = (xp[xi["禄存"]] - 1) % 12
	xp[xi["火星"]] = ([ 2,  3,1, 9,  2, 3,1, 9,  2, 3,1, 9  ][sizhu[0][1]] + sizhu[3][1]) % 12
	xp[xi["铃星"]] = ([ 10,10,3,10, 10,10,3,10, 10,10,3,10  ][sizhu[0][1]] + sizhu[3][1]) % 12
	xp[xi["地空"]] = (11 - sizhu[3][1]) % 12
	xp[xi["地劫"]] = (11 + sizhu[3][1]) % 12


	# 杂耀星
	# 天马， 红鸳， 天喜 ， 孤辰 ，寡宿, 天刑， 天姚， 天德， 年解
	xp[xi["天马"]]  = [ 2,11,8,5, 2,11,8,5, 2,11,8,5  ][sizhu[0][1]]
	xp[xi["红鸳"]]  = (3 - sizhu[0][1]) % 12	
	xp[xi["天喜"]]  = (xp[xi["红鸳"]] + 6) % 12

	
	xp[xi["孤辰"]] = [2,2,5,5,5,8,8,8,11,11,11,2][sizhu[0][1]]
	xp[xi["寡宿"]] = [10,10,1,1,1,4,4,4,7,7,7,10][sizhu[0][1]]


	xp[xi["天刑"]] = (9 + nongdate[:imonth])  % 12
	xp[xi["天姚"]] = (1 + nongdate[:imonth])  % 12
	xp[xi["年解"]] = (10 - sizhu[0][1]) % 12
	
	# "天官","天福","天厨","截路","空亡"
	xp[xi["天官"]] = [7,4,5,2,3,9,11,9,10,6][sizhu[0][0]]
	xp[xi["天福"]] = [9,8,0,11,3,2,6,5,6,5][sizhu[0][0]]
	xp[xi["天厨"]] = [5,6,0,5,6,8,2,6,9,11][sizhu[0][0]]
	xp[xi["截路"]] = [8,6,4,2,0,8,6,4,2,0][sizhu[0][0]]
	xp[xi["空亡"]] = [9,7,5,3,1,9,7,5,3,1][sizhu[0][0]]

	# "天巫","天月","阴煞","解神",
	xp[xi["天巫"]] = [5,8,2,11,5,8,2,11,5,8,2,11][nongdate[:imonth]]
	xp[xi["天月"]] = [10,5,4,2,7,3, 11, 7,2,6,10,2][nongdate[:imonth]]
	xp[xi["阴煞"]] = [2,0,10,8,6,4, 2, 0, 10,8,6,4][nongdate[:imonth]]
	xp[xi["解神"]] = [8,8,10,10,0,0,2,2,4,4,6,6][nongdate[:imonth]]
		

	#"台辅","封诰"
	xp[xi["台辅"]] = [6,7,8,9,10,11,0,1,2,3,4,5][sizhu[3][1]]
	xp[xi["封诰"]] = [2,3,4,5,6,7,8,9,10,11,0,1][sizhu[3][1]]
		
	#"天才","天寿","华盖","天空","天哭","天虚","咸池","龙池","凤阁","蜚廉","破碎",  #56-66
	xp[xi["天才"]] = (minggong + sizhu[0][1]) % 12
	xp[xi["天寿"]] = (shengong + sizhu[0][1]) % 12
	xp[xi["华盖"]] = [4,1, 10,7, 4,1,10,7, 4,1,10,7][sizhu[0][1]] 
	xp[xi["天空"]] = [1,2,3,4,5,6,7,8,9,10,11,0][sizhu[0][1]] 
	xp[xi["天哭"]] = [6,5,4,3,2,1,0,11,10,9,8,7][sizhu[0][1]] 
	xp[xi["天虚"]] = [6,7,8,9,10,11,0,1,2,3,4,5][sizhu[0][1]] 
	xp[xi["咸池"]] = [9,6,3,0,9,6,3,0,9,6,3,0][sizhu[0][1]] 
	xp[xi["龙池"]] = [4,5,6,7,8,9,10,11,0,1,2,3][sizhu[0][1]] 
	xp[xi["凤阁"]] = [10,9,8,7,6,5,4,3,2,1,0,11][sizhu[0][1]] 
	xp[xi["蜚廉"]] = [8,9,10,5,6,7,2,3,4,0,1,2][sizhu[0][1]] 
	xp[xi["破碎"]] = [5,1,9,5,1,9,5,1,9,5,1,9][sizhu[0][1]] 

	#"三台","八座","恩光","天贵"  #67-70
	xp[xi["三台"]] = ( xp[xi["左辅"]] + nongdate[:iday]) % 12
	xp[xi["八座"]] = ( xp[xi["右弼"]] - nongdate[:iday]) % 12
	xp[xi["恩光"]] = ( xp[xi["文昌"]] + nongdate[:iday] - 1) % 12
	xp[xi["天贵"]] = ( xp[xi["文曲"]] + nongdate[:iday] - 1) % 12

	#"天殇","天使"
	xp[xi["天殇"]] = (minggong + 5) % 12
	xp[xi["天使"]] = (minggong + 7) % 12

	# "岁建","晦气","丧门","贯索","官符","小耗","大耗","龙德","白虎","天德", "吊客",病符 #73-82,84
	#xp[xi["岁建"]] = sizhu_today[0][1] 
	#xp[xi["晦气"]] = (sizhu_today[0][1]  + 1) % 12
	#xp[xi["丧门"]] = (sizhu_today[0][1]  + 2) % 12
	#xp[xi["贯索"]] = (sizhu_today[0][1]  + 3) % 12
	#xp[xi["官符"]] = (sizhu_today[0][1]  + 4) % 12
	#xp[xi["小耗"]] = (sizhu_today[0][1]  + 5) % 12
	
	xp[xi["大耗"]] = [7,6,9,8,11,10,1,0,3,2,5,4][sizhu[0][1]]

	#xp[xi["龙德"]] = (sizhu_today[0][1]  + 7) % 12
	#xp[xi["白虎"]] = (sizhu_today[0][1]  + 8) % 12
	xp[xi["天德"]] = (sizhu[0][1]  + 9) % 12
	#xp[xi["吊客"]] = (sizhu_today[0][1]  + 10) % 12
	#xp[xi["病符"]] = (sizhu_today[0][1]  + 11) % 12

	xp[xi["旬空"]] = [ 10, 10, 0, 0 ,2, 2, 4, 4,6, 6,8,8 ] [ (sizhu[0][1] - sizhu[0][0]) % 12 ]
	

	

	#--------------
	# General info
	age = (dt_today.year - dt.year + 1  )

	puts ""
	print 	["阳","阴"][sizhu[0][0] % 2 ],["女","男"][gender],"\n"
	printf 	"%d岁\n", age
	print 	v["五行局"][ wuxingju],"局","\n"
	print 	"命宫:",v["地支"][minggong],"\n"
	print 	"身宫:",v["地支"][shengong],"\n"
	
	changshen_off = o["长生"][wuxingju]
	

	#------------------------
	#先天盘
	sihua 			= o["十干四化"][ sizhu[0][0] ]
	print12gong( wuxingju, minggong , "先天盘" , nongdate , sizhu , v , monthoff , xp, xi , changshen_off, o, sihua )

	#--------------------
	# 大限盘


	if ( age >= wuxingju + 2 )
			
		dx_gong_offset 	= (age - wuxingju - 2) / 10 
		dx_gong 		= minggong + dx_gong_offset

		effective_monthoff = monthoff[ dx_gong < 2 ? 1 : 0 ]
		dx_gan =  (effective_monthoff + dx_gong - 2) % 10

		xp[xi["运昌"]] = (10 - dx_gong ) % 12
		xp[xi["运曲"]] = (4  + dx_gong ) % 12
		xp[xi["运钺"]] = o["天钺"][ dx_gan ] 
		xp[xi["运魁"]] = o["天魁"][ dx_gan ]
		xp[xi["运禄"]] = o["禄存"][ dx_gan ]
		xp[xi["运羊"]] = (xp[xi["运禄"]] + 1) % 12
		xp[xi["运陀"]] = (xp[xi["运禄"]] - 1) % 12

		
		sihua_dx 		= o["十干四化"][ dx_gan ]
		print12gong( wuxingju, dx_gong , "大限盘" , nongdate_today , sizhu_today , v , monthoff , xp, xi , nil, o, sihua_dx )
		
		(xi["运昌"]..xi["运陀"]).each { 
			|x_id|
			xp[x_id] = nil
		}
		

	end


	#--------------------
	# 流年

	

	lnminggong 		= sizhu_today[0][1]
	sihua_ln 		= o["十干四化"][ sizhu_today[0][0] ]

	print12gong( wuxingju, lnminggong , "流年盘" , nongdate_today , sizhu_today , v , monthoff , xp , xi , nil, o, sihua_ln  )


	#-----------
	#-流月
	doujun = (lnminggong - nongdate[:imonth] + sizhu[3][1]) % 12
	lyminggong = (nongdate_today[:imonth] + doujun) % 12
	sihua_ly 		= o["十干四化"][ sizhu_today[1][0] ]
	

	print12gong( wuxingju, lyminggong , "流月盘" , nongdate_today , sizhu_today , v , monthoff , xp , xi , nil, o, sihua_ly  )

	#-----------------
	# 流日
	
	
	xp[xi["流昌"]] = (5 + sizhu_today[2][0] ) % 12
	xp[xi["流曲"]] = (9 - sizhu_today[2][0] ) % 12
	
	xp[xi["流钺"]] = o["天魁"][ sizhu_today[0][0]] 
	xp[xi["流魁"]] = o["天钺"][ sizhu_today[0][0]]

	xp[xi["流鸳"]] = (3 - sizhu_today[0][1]) % 12	
	xp[xi["流喜"]] = (xp[xi["流鸳"]] + 6) % 12
	xp[xi["流禄"]] = o["禄存"][sizhu_today[0][0]]
	xp[xi["流羊"]] = (xp[xi["流禄"]] + 1) % 12
	xp[xi["流陀"]] = (xp[xi["流禄"]] - 1) % 12
	
	sihua_lr = o["十干四化"][ sizhu_today[2][0] ]
	lrminggong = (lyminggong + nongdate_today[:iday])  % 12
	print12gong( wuxingju, lrminggong , "流日盘" , nongdate_today , sizhu_today , v , monthoff , xp , xi , nil, o, sihua_lr  )


	#--------------------
	#流时
	
	lsminggong = ( lrminggong + sizhu_today[3][1] ) % 12
	sihua_ls = o["十干四化"][ sizhu_today[3][0] ]
	print12gong( wuxingju, lsminggong , "流时盘" , nongdate_today , sizhu_today , v , monthoff  , xp , xi , nil, o, sihua_ls  )



end


#-----------------------
def horizontalline
	puts "\n\n"
	print "-" * 80
	puts "\n\n"
end

#-----------------------
def print12gong( wuxingju, mg, title , nd , sz , v , monthoff , lrxp , xi , cs , o , sihua  )


	horizontalline
	
	puts title
	puts "#{ nd[:cmonth] }月 #{ nd[:cday]}"
	(0...4).each { |i|
		print "#{v["天干"][sz[i][0]]}#{v["地支"][sz[i][1]]} "
	}
	puts "\n\n"
	(0...12).each do |i|

		effective_monthoff = monthoff[ i < 2 ? 1 : 0 ]
		gan =  (effective_monthoff + i - 2) % 10

		print v["天干"][gan],v["地支"][i]," "
		print v["十二宫"][ (12 - (i - mg )) % 12]
		print "\t"
		print " ",v["长生"][ (i - cs) % 12 ],"\t" if cs != nil

		if title == "先天盘"
			agebegin = ((i - mg) % 12) * 10 + (wuxingju + 2)
			printf "%d-%d", agebegin,agebegin + 10 - 1
			print "\t"
		end

		xi.values.each { |xid| 
			
			if lrxp != nil && lrxp[xid] == i

				sihua_text = ""
				(0...4).each { |sihua_i| 
					if xi[sihua[sihua_i]] == xid 
						sihua_text = v["十干四化"][sihua_i]
					end 
				}

				print v["星"][xid]

				if xid < 36
					print ["陷","","平","旺"][ o["地支庙陷"][xid][ i ] + 1 ]
					print sihua_text.length > 0 ? "(#{sihua_text})"  : ""
				end
				print "  " 
			end
		}

		puts ""
	end

end

main
